n = input("Здравствуйте! Как Вас зовут? ")
print(f"Очень приятно, {n}! Меня зовут Марк.")
age = int(input("Сколько Вам лет? "))

if age < 78:
    print(f"Да, {n}, я старше Вас на {str(78-age)} лет.")
else:
    print(f"Да, {n}, Вы старше меня на {str(age-78)} лет.")

a = input("Вам нравится программировать? ").lower()
if a == "да":
    print("Превосходно! Уверен, у Вас получится написать множество полезных и хороших программ.")
else:
    print("Жаль. Я думал, Вы сможете написать интересную программу для меня.")