s = input("Собака короткошерстной породы? ").lower()
if s == 'да':
    h = input("Рост собаки менее 50 см? ").lower()
    if h == "да":
        t = input("У собаки короткий хвост? ").lower()
        if t == "да":
            print("английский бульдог")
        else:
            e = input("У собаки длинные уши? ").lower()
            if e == "да":
                print("гончая")
            else:
                b = input("У собаки короткое тело? ").lower()
                if b == "да":
                    print("мопс")
                else:
                    print("чихуахуа")
    else:
        he = input("Собака весит более 50 кг? ").lower()
        if he == "да":
            print("датский бултдог")
        else:
            print("фоксхаунд")
else:
    h1 = input("Рост собаки менее 50 см? ").lower()
    if h1 == "да":
        ch = input("У собаки доброжелательный характер? ").lower()
        if ch == "да":
            print("кокер-спаниэль")
        else:
            print("ирландский сеттер")
    else:
        h2 = input("У собаки рост менее 70 см? ")
        if h2 == "да":
            e1 = input("У собаки длинные уши? ")
            if e1 == "да":
                print("большой вандейский грифон")
            else:
                print("колли")
        else:
            col = input("Окрас рыжий с белыми отметками? ").lower()
            if col == "да":
                print("сербенрар")
            else:
                wh = input("Белоснежный окрас? ").lower()
                if wh == "да":
                    print("ирландский волкодав")
                else:
                    print("ньюфаундленд")
